Repository: OGGM/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/alps_future.po
Languages: de

source: Future evolution of glaciers
de: Die Zukunft aller Gletscher

source: Globally or regionally:
de: Global oder regional:

source: Find out about the global future evolution of glaciers! This interactive graphic displays the volume change of all glaciers worldwide under four different global warming scenarios between +1.5°C and +4°C until 2100. You can also compare the global evolution to single glacier regions.
de: Hier könnt ihr herausfinden wie Gletscher weltweit und regional in der Zukunft auf den Klimawandel reagieren werden.Die interaktive Grafik zeigt die Volumenänderung der Gletscher unter verschiedenen Erwärmungsszenarien zwischen +1.5°C und +4°C bis 2100.Ihr könnt auch die globale Entwicklung mit einzelnen Gletscherregionen vergleichen.

source: European Alps:
de: Europäische Alpen:

source: You can also only look at the evolution of glaciers in the European Alpsand compare the different alpine countries
de: Hier könnt ihr auch erfahren wie Gletscher in deneuropäischen Alpen in der Zukunft schmelzen werden! Ihr könnt auch verschiedene Alpenländer mit Gletschern vergleichen.

source: To start the app, click on this link: |badge_bokeh_en|_
de: Um die App zu starten klicke auf folgendem Link: |badge_bokeh_de|_

source: To start the app, click on this link: |badge_bokeh_en_alps|_
de: Um die App zu starten klicke auf folgendem Link: |badge_bokeh_en_alps|_

source: Authors
de: Autoren

source: `Fabien Maussion <https://fabienmaussion.info/>`_, `Zora Schirmeister <https://github.com/zschirmeister>`_ and `Lilian Schuster <https://github.com/lilianschuster>`_
de: `Fabien Maussion <https://fabienmaussion.info/>`_, `Zora Schirmeister <https://github.com/zschirmeister>`_ und `Lilian Schuster <https://github.com/lilianschuster>`_

source: Data sources
de: Datenquellen

source: Data: `Rounce et al. (2022) <https://doi.org/10.5067/P8BN9VO9N5C7>`_
de: Daten: `Rounce et al. (2022) <https://doi.org/10.5067/P8BN9VO9N5C7>`_

source: Source code
de: Quellcode

source: Code and data are on GitHub for the `Global App <https://github.com/OGGM/science_2023_app>`_,and the `European Alps App <https://github.com/OGGM/alps_future>`_, BSD3 licensed.
de: Code und Daten befinden sich auf GitHub für die`Globale App <https://github.com/OGGM/science_2023_app>`_,und für die `Europäische Alpen App <https://github.com/OGGM/alps_future>`_, BSD3 lizenziert.

source: We welcome any app improvements. Just write us a mail with the jupyter-notebook or send us a pull request!
de: Wir freuen uns über jegliche Verbesserungen der Apps. Schreibt uns einfach eine Mail mit dem Jupyter-Notebook oder schickt uns einen pull request!
