Repository: OGGM/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/classes_howto.po
Languages: fr

source: OGGM-Edu in classes and workshops
fr: OGGM-Edu en classe et dans les ateliers

source: OGGM-Edu can readily be used in your classes and workshops - we encourage you to try it out! Depending on your own knowledge about glaciers, this can require some preparation. Check out :ref:`other_resources` if you are interested in the fundamentals and online textbook materials.
fr: OGGM-Edu peut facilement être utilisé pour vos cours / ateliers - nous vous encourageons à l'essayer ! En fonction de vos connaissances sur les glaciers, cela peut nécessiter une certaine préparation. Consultez la page :ref:`other_resources` si lesprincipes fondamentaux et les manuels en ligne vous intéressent.

source: Currently, we are working on making OGGM-Edu suitable for classes at the high school level (using the web applications) and at the university level (using the programmable notebooks). You will find some help to get you started below.
fr: Nous travaillons actuellement à l'adaptation de l'OGGM-Edu aussi bien pour lesclasses de lycée (en utilisant les applications Web) que pour les cours de niveauuniversitaire (en utilisant les notebooks programmables). Vous trouverez l'aidenécessaire pour vous lancer ci-dessous.

source: Using the OGGM-Edu web apps at the high school level
fr: Utiliser les applications web OOGM-Edu dans les classes de lycée

source: OGGM-Edu can be used to organize a 2 to 4 hours class, possibly even longer. It could be organized as such:
fr: OGGM-Edu peut être utilisé pour construire un cours de 2 à 4 heures, voire plus. Il pourrait être organisé comme suit :

source: General introduction to glaciers: what is a glacier, where do we find them, why are they important?
fr: Introduction générale sur les glaciers : qu'est-ce qu'un glacier, où les trouve-t-on,pourquoi sont-ils importants ?

source: Learn about different glacier types in the :ref:`gallery`.
fr: Découvrir les différents types de glaciers dans la :ref:`gallery`.

source: Learn about the glaciers location and their climate with the :ref:`explorer` app. Use the sample questions to encourage the students to explore the app by themselves or in small groups.
fr: Découvrir l'emplacement des glaciers et leur climat avec l'application :ref:`explorer`. Vous pouvez utiliser les questions en exemple pour encourager les élèves à explorer l'application par eux-mêmes ou en petits groupes.

source: For more advanced classes, learn about glacier flow with the :ref:`simulator`. This app can be used for a number of different experiments, and can be complemented with a `glacier goo <https://www.youtube.com/watch?v=DUdeN5CpsW0>`_ experiment.
fr: Pour des cours plus avancés, approfondissez la notion d'écoulement glaciaire avec le :ref:`simulator`. Cette application peut être utilisée pour un certain nombre de simulations différentes, et peut être complétée par une expérience avec la "glacier goo" <https://www.youtube.com/watch?v=DUdeN5CpsW0>`_ .

source: Using the OGGM-Edu notebooks at the university level
fr: Utiliser les notebooks OGGM-Edu au niveau universitaire

source: We use notebooks frequently for our own `lectures <https://fabienmaussion.info/teaching/>`_, and we are big fans! They allow to convey knowledge in interactive, "try as you learn" practicals, and they encourage active learning.
fr: Nous utilisons fréquemment les cahiers pour nos propres `cours <https://fabienmaussion.info/teaching/>`_, et nous en sommes pleinement satisfaits ! Ils permettent de transmettre des connaissancesde manière interactive, via des travaux pratiques pour "apprendre en essayant", et ils encouragent l'apprentissage actif.

source: Here are a few recommendations based on our own experience:
fr: Voici quelques recommandations basées sur notre propre expérience :

source: **Spend at least two hours explaining the notebook and jupyterlab environments**. Showing their basic features first, then let the students play with a simple and short notebook. In a second session (after an hour or so), summarize the usual pitfalls:
fr: **Passez au moins deux heures à expliquer le fonctionnement du notebook et de jupyterlab**. Montrez d'abord leurs fonctionnalités de base, puis laissez les élèves s'entrainer sur un notebook plutôt simple et court. Dans un deuxième temps (après une heure environ), résumez les pièges habituels :

source: recognize that notebooks are actual files (not something magical on browser)
fr: reconnaître que les notebooks sont de vrais fichiers (et pas quelque chose de magique sur le navigateur)

source: acknowledge that the order of execution of cells matter
fr: constater que l'ordre d'exécution des cellules a son importance

source: acknowledge that errors in cell execution are OK and can be recovered from
fr: constater que les erreurs lors de l'exécution des cellules sont admises et peuvent être corrigées.

source: show how to restart with a fresh notebook
fr: montrer comment recommencer avec un nouveau notebook

source: encourage the use of keyboard shortcuts (such as `[shift+enter]` and `[ctrl+m] + key`)
fr: encourager l'usage des raccourcis clavier ( `[shift+enter]` et `[ctrl+m] + key` par exemple)

source: **On MyBinder: avoid bad surprises by explaining to your class that the sessions are temporary**. Show your students how to download and upload files to JupyterLab so that they feel comfortable saving their work from time to time.
fr: **Sur MyBinder : évitez les mauvaises surprises en expliquant à votre classe que les sessions sont temporaires**. Montrez à vos élèves comment télécharger et uploader des fichiers vers JupyterLab afin qu'ils soient à l'aise avec le fait de sauvegarder leur travail de

source: Whatever your learning goals are, **always plan less than that**. You might find `this blog <https://medium.com/@jasonjwilliamsny/4-practical-suggestions-for-using-jupyter-notebooks-in-tutorials-9c478c8c0032>`_ and this `free online book <https://jupyter4edu.github.io/jupyter-edu-book/>`_ about teaching with jupyter notebooks useful as well.
fr: Quels que soient vos objectifs pédagogiques, **prévoyez toujours moins**. A ce titre, `ce blog <https://medium.com/@jasonjwilliamsny/4-practical-suggestions-for-using-jupyter-notebooks-in-tutorials-9c478c8c0032>`_ et ce `livre en ligne gratuit <https://jupyter4edu.github.io/jupyter-edu-book/>`_ qui traite de l'enseignement avec les notebooks jupyter peuvent se retrouver utiles

source: If you plan to teach about programming aspects as well as about glaciology, **focus on the content** more than on the method. Unfortunately (or fortunately), the "fun" aspect of notebooks and the programming challenges often distract students from what they are actually doing: glaciology and climatology. We've seen students googling about how to change a colormap before even trying to analyse the plot they just produced.
fr: Si vous prévoyez d'enseigner dans le même temps les notions de programmation et de glaciologie, **focalisez vous davantage sur le contenu** que sur la méthode. Malheureusement (ou heureusement), l'aspect "fun" des notebooks et les défis de la programmation distraient souvent les étudiants de ce qu'ils font réellement : de la glaciologie et de la climatologie. Nous avons vu des étudiants chercher sur Google le moyen de changer la palette de couleurs avant même d'essayer d'analyser le graphique qu'ils viennent de produire.

source: If you have the chance to have more experienced students in the room, **organize peer-mentoring in groups of 2 or 3**. Students are often better in mentoring each other than we are.
fr: Si vous avez la chance d'avoir des étudiants plus expérimentés dans la salle, **mettez en place un mentorat par groupes de 2 ou 3**. Les étudiants sont souvent meilleurs dans le mentorat mutuel que nous le sommes.

source: Implementation
fr: Mise en oeuvre

source: Ready to give OGGM-Edu a go? You will find more information in the pages below:
fr: Prêt à vous lancer dans l'aventure OGGM-Edu ? Vous trouverez plus d'informations dans les pages ci-dessous :
