Repository: OGGM/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/explorer.po
Languages: de

source: The world glacier explorer is an **interactive web application** with which you can learn (and teach) about the world's glaciers, their location, their climate, and the ice they store. By "glaciers", we mean all glaciers outside of the two continental ice sheets (Greenland and Antarctica).
de: Der World Glacier Explorer is eine **interaktive Web Applikation** mit der man über die weltweiten Gletscher, deren Lage, Klima und Eis Masse lernen und lehren kann. Mit "Gletscher" meinem wir alle Gletscher, die sich außerhalb der beiden kontinentalen Eisschilde (Grönland und Antarktis) befinden.

source: You can start the app by clicking on this link: |badge_bokeh_en|_
de: Um die App zu starten, klicke auf folgenden Link: |badge_bokeh_en|_

source: **The app contains five elements**:
de: **Die App enthält fünf Elemente**:

source: the **clear selection button** on the left resets the current glacier selection.
de: Der **Clear selection Button** links setzt die aktuelle Auswahl zurück.

source: the **bar plots** (left of the map) indicate various statistics about the current glacier selection (default selection: all glaciers). The upper blue bar indicates the number of glaciers selected, the middle blue bar their total area, and the lower blue bar their estimated volume. This volume can be converted to its *sea-level rise equivalent* (in mm), which is the global sea-level rise to be expected if all glacier vanished. Only glaciers *above* sea-level are contributing to this figure, therefore there are two vertical orange bars: *asl* (above sea-level) and *bsl* (below sea-level). See the demo and explanations below on how to use this information.
de: Das **Balkendiagramm** (links von der Karte) zeigt verschiedene Statistiken über die aktuelle Gletscherauswahl (Standardauswahl: alle Gletscher). Der obere blaue Balken zeigt die Anzahl der ausgewählten Gletscher an, der mittlere blaue Balken ihre Gesamtfläche und der untere blaue Balken ihr geschätztes Volumen. Dieses Volumen kann in ein *Meeresspiegelanstiegsäquivalent* (in mm) umgerechnet werden, d. h. den globalen Meeresspiegelanstieg, der zu erwarten wäre, wenn alle Gletscher verschwinden würden. Nur Gletscher, die *über* dem Meeresspiegel liegen, tragen zu dieser Zahl bei, daher gibt es zwei vertikale orangefarbene Balken: *asl* (oberhalb des Meeresspiegels) und *bsl* (unterhalb des Meeresspiegels). Siehe die Demo und die Erklärungen unten, wie diese Informationen zu verwenden sind.

source: the three **climate histograms plots** (lower row) display the distribution of the selected glaciers' climate conditions. The y-axis is given in number of glaciers per bin, and the x-axis in the unit of the target variable (temperature trend, average temperature, average precipitation at the glacier location). Selecting a range of values in these plots also actualizes the map and the rest of the plots (see demo below).
de: Die drei **Klima-Histogramme** (untere Reihe) zeigen die Verteilung der klimatischen Bedingungen der ausgewählten Gletscher. Die y-Achse ist in der Anzahl der Gletscher pro Bin angegeben, die x-Achse in der Einheit der Zielvariablen (Temperaturtrend, Durchschnittstemperatur, Durchschnittsniederschlag am Gletscherstandort). Durch die Auswahl eines Wertebereichs in diesen Diagrammen werden auch die Karte und die übrigen Diagramme aktualisiert (siehe Demo unten).

source: the **glacier elevation/altitude scatter plot** (lower right) displays the average elevation of the glaciers on the map as a function of latitude (y-axis).
de: Das **(Gletscher-)Höhenstreudiagramm** (unten rechts) zeigt die durchschnittliche Höhe der Gletscher auf der Karte in Abhängigkeit von der geografischen Breite (y-Achse).

source: Part 1: app functionalities
de: Teil 1: App Funktionen

source: Part 2: example questions
de: Teil 2: Beispielfragen

source: Questions to explore with this app
de: Fragen, die mit dieser App bearbeitet werden können

source: We suggest motivating the app with a question to be answered in class. For example:
de: Wir empfehlen, die Anwendung mit ein paar Fragen zu motivieren. Zum Beispiel:

source: How many glaciers are there on Earth? How much volume do they represent?
de: Wie viele Gletscher gibt es auf der Erde? Wie groß ist ihr Volumen?

source: How much would the sea-level rise if all glaciers melted? All glaciers in the Alps? In the Himalayas? etc.
de: Um wie viel würde der Meeresspiegel ansteigen, wenn alle Gletscher schmelzen würden? Wenn alle Gletscher in den Alpen schmelzen würden? Alle im Himalaya? ...

source: What is the relationship between latitude and glacier elevation? Why?
de: Welcher Zusammenhang besteht zwischen Geographischer Breite und Höhe des Gletschers? Warum?

source: Where are the locations with highest precipitation? And the driests?
de: Welche Orte bekommen am meisten Niederschlag? Welche am wenigsten?

source: Is there a relationship between average temperature and average precipitation?
de: Gibt es einen Zusammanhang zwischen mittlerer Temperature und mittlerer Niderschlagsmenge?

source: How much glacier area is found on Greenland? In the European Alps? How does these number compare to, say, the area of Berlin, France, Mexico?
de: Wie viele Gletscher gibt es auf Grönland? Wie viele in den Alpen? Wie groß ist diese Fläche verglichen mit der Fläche von Berlin, Frankreich oder Mexiko?

source: Does the number of glaciers in a region always correlate with their total volume?
de: Hängt die Anzahl an Gletschern in einer Region immer mit ihrem Gesamtvolumen zusammen?

source: What regions are most likely to contribute to sea-level rise? Where do we find glaciers with ice below sea-level?
de: Welche Regionen tragen am wahrscheinlichsten zum Meeresspiegelanstieg bei? Wo gibt es Gletscher, deren Eis unter dem Meeresspiegel gelegen ist?

source: Where are the glaciers which are warming the fastest? Why?
de: Welche Gletscher erwärmen sich am schnellsten? Warum?

source: Where are the wettest glaciers in the Himalayas? (select all Himalayan glaciers first, then the wettest). Can you explain why?
de: Wo befinden sich die feuchtesten Gletscher des Himalayas (wähle erst alle Himalaya Gletscher aus, befor du den feuchtesten auswählst). Kannst du erklären warum?

source: Repeat the excercise above with other regions: Greenland, the Alps, etc.
de: Wiederhole die obere Aufgabe mit anderen Regionen: Grönland, die Alpen, ...

source: And many more!
de: Und viele mehr!

source: Resources
de: Ressourcen

source: Several pages from `Glaciers and Climate <http://www.antarcticglaciers.org/glaciers-and-climate/>`_ on `antarcticglaciers.org`_ are highly relevant here
de: Mehrere Seiten aus `Glaciers and Climate <http://www.antarcticglaciers.org/glaciers-and-climate/>`_ on `antarcticglaciers.org`_ sind hier höchst relevant.

source: `Warming trends at glaciers locations <https://fabienmaussion.info/2019/08/29/era5/>`_, a blog post by Fabien Maussion
de: `Warming trends at glaciers locations <https://fabienmaussion.info/2019/08/29/era5/>`_, ein Blog Post von Fabien Maussion

source: `OGGM-Edu Glaciology Lab 2 - Exploring glacier data <https://serc.carleton.edu/teachearth/activities/250446.html>`_ provides a lesson plan and materials to use the World Glacier Explorer in a 1.5-2 hour class or lab session
de: `OGGM-Edu Glaciology Lab 2 - Exploring glacier data <https://serc.carleton.edu/teachearth/activities/250446.html>`_ (in englisher Sprache)

source: Authors
de: Authoren

source: Glacier location, elevation and area are obtained from the `Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_. The climate data (temperature, precipitation, trends) is extracted from `ERA5 data <https://www.ecmwf.int/en/forecasts/datasets/reanalysis-datasets/era5>`_ provided by the `ECMWF <https://www.ecmwf.int/>`_. The glacier volume was provided by `Farinotti et al., (2019) <https://www.nature.com/articles/s41561-019-0300-3>`_
de: Gletscher Lage, Höhe und Größe stammen von `Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_. Die Klimadaten (Temperatur, Niederschlag, Trends) wurden aus den `ERA5 data <https://www.ecmwf.int/en/forecasts/datasets/reanalysis-datasets/era5>`_ von `ECMWF <https://www.ecmwf.int/>`_ entnommen. Das Gletscher Volume enspricht `Farinotti et al., (2019) <https://www.nature.com/articles/s41561-019-0300-3>`_

source: Source code
de: Quellcode

source: Code and data are on `GitHub <https://github.com/OGGM/world-glacier-explorer>`_, MIT licensed.
de: Code und Daten sind auf `GitHub <https://github.com/OGGM/world-glacier-explorer>`_, MIT lizensiert.

source: Launching from Docker
de: Starten aus Docker

source: This application should work quite well online, either on our server or on mybinder. But you can also start the app locally, which will make it faster and less dependent on an internet connection (although you still need one to download the app, display the logos and the map).
de: Diese Anwendung sollte recht gut online funktionieren, entweder auf unserem Server oder auf mybinder. Sie können die Anwendung aber auch lokal starten, was sie schneller und weniger abhängig von einer Internetverbindung macht (obwohl Sie eine solche immer noch benötigen, um die Anwendung herunterzuladen, die Logos und die Karte anzuzeigen)

source: To start the app locally, all you'll need is to have `Docker <https://www.docker.com/>`_ installed on your computer. From there, run this command into a terminal::
de: Um die Anwendung lokal zu starten, müssen Sie lediglich `Docker <https://www.docker.com/>`_ auf Ihrem Computer installiert haben. Führen Sie dann diesen Befehl in einem Terminal aus::

source: Once running, you should be able to start the app in your browser at this address: `http://127.0.0.1:8083/ <http://127.0.0.1:8083/>`_.
de: Sobald die Anwendung läuft, sollten Sie sie in Ihrem Browser unter dieser Adresse starten können: `http://127.0.0.1:8080/ <http://127.0.0.1:8080/>`_.
