Repository: OGGM/oggm-edu
Catalog: docs/locale/*/LC_MESSAGES/gallery.po
Languages: de

source: Glacier Gallery
de: Gletschergalerie

source: The glacier gallery is an **interactive web application** with which you can learn (and teach) about the diverse glaciers of the world. It introduces different glacier types with pictures and explanations. It includes typical glaciers from nearly all glaciated regions of the world.
de: Die Gletschergalerie ist eine **interaktive Webanwendung**, mit der man über die verschiedenen Gletscher der Welt lernen (und lehren) kann. Sie stellt verschiedene Gletschertypen mit Bildern und Erklärungen vor. Sie enthält typische Gletscher aus fast allen vergletscherten Regionen der Welt.

source: How to use it
de: Benutzeranleitung

source: The app contains an interactive **map** with marked glaciers. The markers are color-coded according to the glacier’s type. When the mouse hovers above one, information about that glacier and a picture of it appears. When you click on the marker information about the glaciertype pop up in the **infobox** on the right. The box has a second tap that shows information about glaciers in general. If you want to choose a different glacier click into the map to delete your selection and choose a new marker.
de: Die App enthält eine interaktive **Karte** mit markierten Gletschern. Die Markierungen sind je nach Gletschertyp farblich gekennzeichnet. Wenn man mit der Maus über einen Gletscher fährt, erscheinen Informationen, sowie ein Bild dieses Gletschers. Durch klicken auf die Markierung, erscheinen Informationen über den Gletschertyp in der **Infobox** auf der rechten Seite. In der Box gibt es einen zweiten Reiter, der Informationen über Gletscher im Allgemeinen gibt. Um einen anderen Gletscher auszuwählen, klicke in die Karte. Dadurch wird die derzeitige Auswahl gelöscht und es kann ein neuer Marker ausgewählt werden.

source: Authors
de: Autoren

source: Data sources
de: Datenquellen

source: Glacier location and sizes are obtained from the `Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_.
de: Lage und Größe der Gletscher sind dem "Randolph Glacier Inventory version 6 <https://www.glims.org/RGI/>`_. entnommen

source: See the app for links to other data sources and pictures.
de: In der App findet man Links zu weiteren Datenquellen und Bildern

source: Source code
de: Quellcode

source: Code and data are on `GitHub <https://github.com/OGGM/glacier-gallery>`_, BSD licensed.
de: Code und Daten sind auf `GitHub <https://github.com/OGGM/glacier-gallery>`_,unter BSD lizensiert.

source: Possible future improvements
de: Mögliche künftige Verbesserungen

source: The application would profit from additional glaciers in regions that are not covered yet. If you are interested to contribute you can add a glacier and an image of it into this `list <https://github.com/OGGM/glacier-gallery/blob/master/glacier_data.py>`_. You can send us the edited file per mail or with a pull-request. Thanks!
de: Die Anwendung würde von zusätzlichen Gletschern in Regionen profitieren, die noch nicht abgedeckt sind. Bei Interesse, etwas beizutragen, kann ein Gletscher und ein Bild davon in dieser `Liste <https://github.com/OGGM/glacier-gallery/blob/master/glacier_data.py>`_ hinzugefügt werden. Die bearbeitete Datei kann uns per Mail oder mit einem Pull-Request geschickt werden. Danke!
